MTAS/MTASCreateBasicIR92.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/" xmlns:mtas="http://schemas.ericsson.com/ema/UserProvisioning/MTAS/">
   <soapenv:Header>
      <cai3:SessionId>${SessionId}</cai3:SessionId>
   </soapenv:Header>
   <soapenv:Body>
      <cai3:Create>
         <cai3:MOType>Subscription@http://schemas.ericsson.com/ema/UserProvisioning/MTAS/</cai3:MOType>
         <cai3:MOId>
            <mtas:publicId>${publicIdValue}</mtas:publicId>
         </cai3:MOId>
         <cai3:MOAttributes>
            <mtas:createSubscription publicId="${publicIdValue}">
				<mtas:publicId>${publicIdValue}</mtas:publicId>
				<mtas:services>
					<mtas:communication-diversion>
						<mtas:cdiv-operator-configuration>
							<mtas:activated>true</mtas:activated>
							<mtas:user-no-reply-timer>activated</mtas:user-no-reply-timer>
                            <mtas:cdiv-op-conditions>
								<mtas:busy-condition>activated</mtas:busy-condition>
								<mtas:no-answer-condition>activated</mtas:no-answer-condition>
								<mtas:not-reachable-condition>activated</mtas:not-reachable-condition>
							</mtas:cdiv-op-conditions>
                            <mtas:cdiv-op-actions>
								<mtas:rule-no-reply-timer>activated</mtas:rule-no-reply-timer>
                            </mtas:cdiv-op-actions>
                        </mtas:cdiv-operator-configuration>
                        <mtas:cdiv-user-configuration>
							<mtas:active>true</mtas:active>
                            <mtas:cdiv-service-options>
								<mtas:NoReplyTimer>15</mtas:NoReplyTimer>
                            </mtas:cdiv-service-options>
                            <mtas:cdiv-ruleset>
                                <mtas:cdiv-rule id="unconditional">
                                    <mtas:id>unconditional</mtas:id>
                                    <mtas:cdiv-conditions>
                                        <mtas:rule-deactivated>true</mtas:rule-deactivated>
                                    </mtas:cdiv-conditions>
                                    <mtas:cdiv-actions>
                                        <mtas:forward-to>
											<mtas:target>tel:+4520171717</mtas:target>
                                        </mtas:forward-to>
                                    </mtas:cdiv-actions>
                                </mtas:cdiv-rule>
                                <mtas:cdiv-rule id="cfnrc">
                                    <mtas:id>cfnrc</mtas:id>
                                    <mtas:cdiv-conditions>
										<mtas:cdiv-call-state>not-reachable</mtas:cdiv-call-state>
                                    </mtas:cdiv-conditions>
                                    <mtas:cdiv-actions>
                                        <mtas:forward-to>
											<mtas:target>tel:+4520171717</mtas:target>
                                        </mtas:forward-to>
                                    </mtas:cdiv-actions>
                                </mtas:cdiv-rule>
                                <mtas:cdiv-rule id="call-diversion-unanswered">
                                    <mtas:id>call-diversion-unanswered</mtas:id>
                                    <mtas:cdiv-conditions>
										<mtas:cdiv-call-state>no-answer</mtas:cdiv-call-state>
                                    </mtas:cdiv-conditions>
                                    <mtas:cdiv-actions>
                                        <mtas:forward-to>
											<mtas:target>tel:+4520171717</mtas:target>
                                        </mtas:forward-to>
                                    </mtas:cdiv-actions>
                                </mtas:cdiv-rule>
								<mtas:cdiv-rule id="call-diversion-busy">
                                    <mtas:id>call-diversion-busy</mtas:id>
                                    <mtas:cdiv-conditions>
										<mtas:cdiv-call-state>busy</mtas:cdiv-call-state>
                                    </mtas:cdiv-conditions>
                                    <mtas:cdiv-actions>
                                        <mtas:forward-to>
											<mtas:target>tel:+4520171717</mtas:target>
                                        </mtas:forward-to>
                                    </mtas:cdiv-actions>
								</mtas:cdiv-rule>
							</mtas:cdiv-ruleset>    
						</mtas:cdiv-user-configuration>
                    </mtas:communication-diversion>              
					<mtas:conference>
						<mtas:conf-operator-configuration>
							<mtas:activated>true</mtas:activated>
							<mtas:max-number-of-parties>5</mtas:max-number-of-parties>
						</mtas:conf-operator-configuration>
					</mtas:conference>
					<mtas:incoming-communication-barring>
						<mtas:icb-operator-configuration>
							<mtas:activated>true</mtas:activated>
							<mtas:icb-ruleset>
								<mtas:icb-rule id="BAIC">
									<mtas:id>BAIC</mtas:id>
									<mtas:icb-conditions>
										<mtas:rule-deactivated>true</mtas:rule-deactivated>
										<mtas:icb-caller-identity>
											<mtas:other-identity/>
										</mtas:icb-caller-identity>
									</mtas:icb-conditions>
									<mtas:cb-actions>
										<mtas:allow>false</mtas:allow>
									</mtas:cb-actions>
								</mtas:icb-rule>
								<mtas:icb-rule id="BICRO">
									<mtas:id>BICRO</mtas:id>
									<mtas:icb-conditions>
										<mtas:rule-deactivated>true</mtas:rule-deactivated>
										<mtas:roaming>true</mtas:roaming>
									</mtas:icb-conditions>
									<mtas:cb-actions>
										<mtas:allow>false</mtas:allow>
									</mtas:cb-actions>
								</mtas:icb-rule>							
							</mtas:icb-ruleset>
							<mtas:icb-op-conditions>
								<mtas:roaming-condition>activated</mtas:roaming-condition>
								<mtas:other-identity-condition>activated</mtas:other-identity-condition>
							</mtas:icb-op-conditions>		
							<mtas:icb-op-actions>
								<mtas:allow-true-action>deactivated</mtas:allow-true-action>
							</mtas:icb-op-actions>
							<mtas:rule-limit>10</mtas:rule-limit>
						</mtas:icb-operator-configuration>
						<mtas:icb-user-configuration>
							<mtas:active>false</mtas:active>
						</mtas:icb-user-configuration>
					</mtas:incoming-communication-barring>
					<mtas:outgoing-communication-barring>
						<mtas:ocb-operator-configuration>
							<mtas:activated>true</mtas:activated>
                            <mtas:ocb-ruleset>
                                <mtas:ocb-rule id="BAOC">
									<mtas:id>BAOC</mtas:id>
                                    <mtas:ocb-conditions>
                                        <mtas:rule-deactivated>true</mtas:rule-deactivated>
                                    </mtas:ocb-conditions>
                                    <mtas:cb-actions>
										<mtas:allow>false</mtas:allow>
                                    </mtas:cb-actions>
                                </mtas:ocb-rule>
                                <mtas:ocb-rule id="BOIEXH">
                                    <mtas:id>BOIEXH</mtas:id>
                                    <mtas:ocb-conditions>
                                        <mtas:rule-deactivated>true</mtas:rule-deactivated>
                                        <mtas:international-exHC>true</mtas:international-exHC>
                                    </mtas:ocb-conditions>
                                    <mtas:cb-actions>
                                        <mtas:allow>false</mtas:allow>
                                    </mtas:cb-actions>
                                </mtas:ocb-rule>
                                <mtas:ocb-rule id="BOIC">
                                    <mtas:id>BOIC</mtas:id>
                                    <mtas:ocb-conditions>
                                        <mtas:rule-deactivated>true</mtas:rule-deactivated>
                                        <mtas:international>true</mtas:international>
                                    </mtas:ocb-conditions>
                                    <mtas:cb-actions>
                                        <mtas:allow>false</mtas:allow>
                                    </mtas:cb-actions>
                                </mtas:ocb-rule>
                            </mtas:ocb-ruleset>
                            <mtas:ocb-op-conditions>
                                <mtas:international-condition>activated</mtas:international-condition>
                                <mtas:international-exHC-condition>activated</mtas:international-exHC-condition>
                                <mtas:other-identity-condition>activated</mtas:other-identity-condition>
                            </mtas:ocb-op-conditions>
                            <mtas:ocb-op-actions>
                                <mtas:allow-true-action>deactivated</mtas:allow-true-action>
                                <mtas:play-announcement-action>activated</mtas:play-announcement-action>
                            </mtas:ocb-op-actions>
                            <mtas:rule-limit>10</mtas:rule-limit>
                        </mtas:ocb-operator-configuration>
                        <mtas:ocb-user-configuration>
                            <mtas:active>false</mtas:active>
                        </mtas:ocb-user-configuration>
                    </mtas:outgoing-communication-barring>
					<mtas:originating-identity-presentation>
						<mtas:oip-operator-configuration>
							<mtas:activated>true</mtas:activated>
							<mtas:restriction-override>override-not-active</mtas:restriction-override>
						</mtas:oip-operator-configuration>
						<mtas:oip-user-configuration>
							<mtas:active>true</mtas:active>
						</mtas:oip-user-configuration>
					</mtas:originating-identity-presentation>
					<mtas:originating-identity-presentation-restriction>
						<mtas:oir-operator-configuration>
							<mtas:activated>true</mtas:activated>
							<mtas:mode>ad-hoc-temporary-presentation-not-restricted</mtas:mode>
						</mtas:oir-operator-configuration>
						<mtas:oir-user-configuration>
							<mtas:active>true</mtas:active>
							<mtas:default-behaviour>presentation-not-restricted</mtas:default-behaviour>
						</mtas:oir-user-configuration>
					</mtas:originating-identity-presentation-restriction>                         
					<mtas:user-call-admission-control>
						<mtas:ucac-operator-configuration>
							<mtas:activated>true</mtas:activated>
							<mtas:orig-active-limit>3</mtas:orig-active-limit>
							<mtas:term-active-limit>2</mtas:term-active-limit>
							<mtas:total-active-limit>3</mtas:total-active-limit>
							<mtas:orig-all-limit>3</mtas:orig-all-limit>
							<mtas:term-all-limit>2</mtas:term-all-limit>
							<mtas:total-all-limit>3</mtas:total-all-limit>
							<mtas:waiting-limit>0</mtas:waiting-limit>
						</mtas:ucac-operator-configuration>
					</mtas:user-call-admission-control>
				</mtas:services>
            </mtas:createSubscription>
         </cai3:MOAttributes>
      </cai3:Create>
   </soapenv:Body>
</soapenv:Envelope>